Rh1ne-ops/stm32f103-learning/11-1 软件SPI读写W25Q64/Hardware/MySPI.c
#include "stm32f10x.h"                  // Device header

void MySPI_W_SS(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOA,GPIO_Pin_0,(BitAction)BitValue);
}
void MySPI_W_SCK(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOA,GPIO_Pin_1,(BitAction)BitValue);
}
void MySPI_W_MOSI(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOA,GPIO_Pin_3,(BitAction)BitValue);
}
uint8_t MySPI_R_MISO(void)
{
	return GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_2);
}






void MySPI_Init(void)
{	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode =  GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin	= GPIO_Pin_0 | GPIO_Pin_1| GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed	=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	
	GPIO_InitStructure.GPIO_Mode =  GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin	= GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed	=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	MySPI_W_SS(1);
	MySPI_W_SCK(0);

}
void MySPI_Start(void)
{
	MySPI_W_SS(0);	
}
void MySPI_Stop(void)
{
	MySPI_W_SS(1);	
}
uint8_t MySPI_SwapByte(uint8_t ByteSend)
{
	uint8_t i,ByteReceive  = 0x00;                       // & 有一个是0就为1，|有一个是0就为0；

	for(i=0;i<8;i++){
		MySPI_W_MOSI(!!(ByteSend & (0x80 >> i)));
		MySPI_W_SCK(1);	
		if( MySPI_R_MISO() == 1){ByteReceive  |= (0x80 >> i);}
		MySPI_W_SCK(0);	
	
	}

	
	
	return ByteReceive;
}
//uint8_t MySPI_SwapByte(uint8_t ByteSend)       第二种方法 移位   缺点：传入参数消失
//{                                               
//	uint8_t i;                       // & 有一个是0就为1，|有一个是0就为0；

//	for(i=0;i<8;i++){
//		MySPI_W_MOSI(ByteSend & 0x80 );
//		ByteSend <<= 1 ;
//		MySPI_W_SCK(1);	
//		if( MySPI_W_MISO() == 1){ByteSend |= 0x01;}
//		MySPI_W_SCK(0);	
//	
//	}

//	
//	
//	return ByteSend;
//}
























